Repository: deviodigital/wp-plugin-info-card
Catalog: langs/wppic-translate-*.po
Languages: pl_pl

source: WordPress.org Plugin Page
pl_pl: Strona wtyczki w WordPress

source: Ratings
pl_pl: Oceny

source: Downloads
pl_pl: Pobrania

source: Requires
pl_pl: Wymagania

source: Download
pl_pl: Pobierz

source: Direct download
pl_pl: Link bezpośredni

source: Back
pl_pl: Cofnij

source: Enable dashboard widget
pl_pl: Aktywuj widget w Kokpicie

source: List of plugin to display
pl_pl: Lista wtyczek do wyświetlenia

source: How does it work?
pl_pl: Jak to działa?

source: WP Plugin Info Card allows you to display plugins identity cards in a beautiful box with a smooth 3D rotation effect.
pl_pl: WP Plugin Info Cars pozwala Ci wyświetlić informacje o wtyczce w pięknym stylu używając przy tym animacji obrotu w 3D.

source: It uses Wordpress.org plugin API to fetch data. All you need to do is provide a valid plugin ID (slug name), and then insert the shortcode in any page to make it work at once!
pl_pl: Wtyczka używa API WordPress.org aby pobrać wszystkie potrzebne dane. Jedyne co musisz podać to nazwę wtyczki (slug) i wstawić ją w shortcodzie. Shortcode możesz użyć na każdej stronie!

source: Shortcode parameters
pl_pl: Parametry shortcode

source: image url to replace WP logo (default: empty)
pl_pl: url obrazka do zmiany loga pobranego z WP (domyślnie puste)

source: 128x128.jpg, 256x256.jpg, 128x128.png, 256x256.png, svg, no (default: svg)
pl_pl: 128x128.jpg, 256x256.jpg, 128x128.png, 256x256.png, svg, no (domyślnie: svg)

source: jpg, png, no (default:empty)
pl_pl: jpg, png, no (default: puste)

source: center, left, right (default: empty)
pl_pl: center, left, right (default: puste)

source: value to print : url, name, version, author, requires, rating, num_ratings, downloaded, last_updated, download_link (default: empty)
pl_pl: wartości do wyświetlenia: url, name, version, author, requires, rating, num_ratings, downloaded, last_updated, download_link (default: puste)

source: Basic example
pl_pl: Prosty przykład

source: The slug is the only required parameter.
pl_pl: slug jest jedynym wymaganym parametrem

source: Advanced examples
pl_pl: Zaawansowane przykłady

source: If the plugin has a WordPress logo (new feature on wp), you may specify its extension (jpg, png or svg) and whether it is a JPG or PNG file, its dimensions (128x128 or 256x256). If not, set "logo" to "no" to avoid a 404 error in the console log (see explanation below).
pl_pl: Jeśli wtyczka ma załadowane logo (nowa opcja w WordPress), możesz wyszczególnić jego rozszerzenie (jpg, png lub svg) i jeśli jest to jpg lub png - jego rozmiar (128x128 lub 256x256). Jeśli nie ma załadowanego loga, ustaw parametr "logo" na "no", aby uniknąć błędu 404 podczas ładowania obrazka (zobacz wyjaśnienie niżej).

source: You may provide a custom image URL for the front rounded image (175px X 175px), it will supplant the "logo" parameter if specified. If you know the banner extension (image displaying on the top of the plugin page), you may provide it to avoid a 404 error in the console log (see explanation below).
pl_pl: Możesz podać niestandardowy adres URL obrazka dla zaokrąglonej miniatury (175x175px), nadpisze to parametr "logo". Jeśli znasz rozszerzenie bannera (obrazek wyświetlany na górze strony wtyczki w WordPress.org) możesz je podać aby uniknąć błędu 404 w konsoli (zobacz wyjaśnienie niżej).

source: The custom parameter supplants the others (except the "slug") and only returns the value you required.
pl_pl: Podanie parametrów nadpisze wartości domyślne (z wyjątkiem parametru "slug") i zwróci tylko porządane wartości

source: Known issues
pl_pl: Znane błędy

source: WordPress.org does not currently include a banner nor plugin logo in the API. As explained in the Developper Center, banners are located in the assets folder of the plugin repository (allowed format are JPG or PNG) and they are named banner-772x250.
pl_pl: WordPress.prg nie obługuje w tym momencie bannera ani loga w swoim API. Jak wyjaśniono w Centrum Developera, bannery są umieszczane w folderze assets w repozytorium wtyczki (dozwolone formaty to jpg i png) i są nazwane banner-772x250.

source: It would be nice to test if banner-772x250.jpg or banner-772x250.png exists, but WordPress does not accept HTTP request to their servers, so requests are blocked due to Cross-Origin restriction. It is the same issue for the plugin SVG, JPG or PNG logo.
pl_pl: Byłoby miło przetestować czy banner-772x250.jpg lub banner-772x250.png istnieje, ale WordPress nie akceptuje zapytań HTTP do swoich serwerów (blokada Cross-Origin). Ten sam problem istnieje dla obrazków svg, jpg, png.

source: The workaround is to use CSS backgound fallback, but it gives a 404 server response. To avoid those errors, please specify the "logo" and "banner" parameters. In any case, 404 is not really an "error", but a simple server response.
pl_pl: Obejściem tego problemu jest użycie CSS background, ale daje ono błąd 404. Aby uniknąć tych błędów proszę sprecyzuj parametry "logo" i "banner". Jeśli otrzymasz błąd 404 to jest to wyłącznie odpowiedź serwera.

source: Dashboard Widget Settings
pl_pl: Ustawienia widgetu w Kokpicie

source: Help: Don't forget to open the dashboard option panel (top right) to insert it on your dashboard.
pl_pl: Wskazówka: Nie zapomnij otworzyć Opcji ekranu w prawym górnym rogu kokpitu, aby wyświetlić widget.

source: Add a plugin
pl_pl: Dodaj wtyczkę

source: Please refer to the plugin URL on wordpress.org to determine its slug
pl_pl: Odnieś się proszę do adresu url wtyczki na wordpress.org aby ustalić jej slug

source: is not a valid plugin name format. This key has been deleted.
pl_pl: nie jest prawidłowym formatem nazwy. Klucz został usunięty.

source: Options saved
pl_pl: Opcje zapisane

source: Plugin home page
pl_pl: Strona wtyczki

source: My other plugins
pl_pl: Moje inne wtyczki

source: Support
pl_pl: Pomoc

source: Give me five!
pl_pl: Przybij piątkę!

source: Did you like it? If so, please consider making a donation.
pl_pl: Lubisz ten plugin? Jeśli tak, rozważ dotację.

source: PayPal - The safer, easier way to pay online!
pl_pl: PayPal - Bezpieczniejszy sposób płacenia online!

source: Settings
pl_pl: Ustawienia

source: Any suggestions?
pl_pl: Sugestie?

source: How to use WP Plugin Info Card shortcodes?
pl_pl: Jak używać shortcodu WP Plugin Info Card?

source: This plugin is very light and includes scripts and CSS only if and when required. For technical reason (it is a choice), the plugin will only works in your body content, not in your sidebar (widget area).
pl_pl: Ta wtyczka jest lekka i dołącza skrypty oraz style tylko wtedy kiedy jest taka potrzeba. Ze względów technicznych wtyczka będzie działała tylko w treści strony, a nie w widgetach.

source: It also uses Wordpress transients to store data returned by the API for 10 minutes, so your page loading time will not be increased due to too many requests.
pl_pl: Używa ona WordPress Transient do przetrzymywania danych z API przez 10 minut więc Twoja strona nie będzie się ładowała dłużej ze względu na dużą ilość zapytań.

source: plugin slug name - Please refer to the plugin URL on wordpress.org to determine its slug: https://wordpress.org/plugins/THE-SLUG/
pl_pl: slug wtyczki - odnieś się do url na wordpress.org: https://wordpress.org/plugins/SLUG

source: Current Version:
pl_pl: Obecna wesja:

source: Last Updated:
pl_pl: Ostatnio zaktualizowany:

source: Ratings:
pl_pl: Oceny:

source: Downloads:
pl_pl: Pobrań:

source: Author(s):
pl_pl: Autorzy:

source: No plugin found
pl_pl: Nie znaleziono wtyczki

source: Ajaxify dashboard widget
pl_pl: Użyj AJAX do ładowania widgetu w Kokpicie

source: Will load the data asynchronously with AJAX.
pl_pl: Widget będzie ładowany asynchronicznie przy użyciu AJAX

source: Plugin not found:
pl_pl: Wtyczka nie znaleziona:

source: does not exist.
pl_pl: nie istnieje.

source: custom div id, may be used for anchor (default: wp-pic-PLUGIN-NAME)
pl_pl: niestandardowy id dla div, (domyślnie: wp-pic-NAZWA-WTYCZKI)

source: custom container margin - eg: "15px 0" (default: empty)
pl_pl: niestandardowe marginesy kontenera - np. "15px 0" (default: puste)

source: clear float before or after the card: before, after (default: empty
pl_pl: czyści float przed lub po widgecie (domyślnie: puste)

source: cache duration in minutes - numeric format only (default: 10)
pl_pl: czas przetrzymywania cache w minutach - tylko wartości liczbowe (domyślnie: 10)

source: load the plugin data asynchronously with AJAX: yes, no (default: no)
pl_pl: ładuj dane wtyczki asynchronicznie przez AJAX: yes, no (domyślnie: no)
